cf/Catalogs/КартинкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартинкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтGarage</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтLicota</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтProm</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияКартинки</Name>
					<Comment>значит что эта картинка точно такаяже и на нее ссылается текущая картинка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КартинкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВОблакеЛокальный</Name>
					<Comment>относительный путь к файлу в облаке относительно сервера 1с</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВОблакеHTTP</Name>
					<Comment>Относительный путь к картинке из вне по http</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеАватар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеКартинка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИконкаКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/Корзина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Корзина</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРучнойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПомещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяКомпа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентРучнойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/КартинкиНоменклатуры/Forms/Галерея_ст/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьКартинкиНаСервере(ТекКартинка)
	
	КартинкаМаленькая 	= Картинки.ПолучитьНавигационнуюСсылкуКартинки(ТекКартинка, Истина);
	КартинкаБольшая 	= Картинки.ПолучитьНавигационнуюСсылкуКартинки(ТекКартинка, Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьКартинки()
	
	ТекКартинка = Элементы.СписокКартинок.ТекущаяСтрока;
	Если текКартинка = Неопределено Тогда 
		
		КартинкаМаленькая 	= "";
		КартинкаБольшая 	= "";
	
	Иначе ОбновитьКартинкиНаСервере(ТекКартинка) КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Элементы.СписокНоменклатуры.ТекущаяСтрока = Параметры.Отбор.Владелец; КонецЕсли;
	
КонецПроцедуры

#Область Интерактивные // действия

&НаСервере
Функция ПолучитьПервуюКарттинкуТовара(текТовар)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.КартинкиНоменклатуры ГДЕ Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", текТовар);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда Возврат Выборка.Ссылка КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокКартинок, "Владелец", Элемент.ТекущаяСтрока, Истина);
	Элементы.СписокКартинок.ТекущаяСтрока = ПолучитьПервуюКарттинкуТовара(Элемент.ТекущаяСтрока);
	
	ОбновитьКартинки();
	
КонецПроцедуры
&НаКлиенте
Процедура СписокКартинокПриАктивизацииСтроки(Элемент)
	
	ОбновитьКартинки();
	
КонецПроцедуры

#КонецОбласти

#Область Обработка // и запись картинок

&НаСервере
Функция ЗаписатьНовыйСправочник(Имя, Владелец, УжеЕстьНовСправочник = Неопределено)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.КартинкиНоменклатуры ГДЕ Владелец = &Владелец И ЭтоПредставлениеОбъекта");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	НовСпрКартинка = ?(УжеЕстьНовСправочник = Неопределено, Справочники.КартинкиНоменклатуры.СоздатьЭлемент(), УжеЕстьНовСправочник);
	НовСпрКартинка.Владелец 				= Владелец;
	НовСпрКартинка.Наименование 			= Имя;
	НовСпрКартинка.ВыгружатьНаСайт 			= Истина;
	НовСпрКартинка.ЭтоПредставлениеОбъекта 	= Запрос.Выполнить().Пустой();
	
	Если ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовСпрКартинка) Тогда
		Возврат НовСпрКартинка.Ссылка КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура ЗагрузитьКартинку(ЭтоАватар, СтандартнаяОбработка = Ложь, ЭтоНоваяКартинка = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	// Проверим
	
	ТекНоменклатура = Элементы.СписокНоменклатуры.ТекущаяСтрока;
	Если ТекНоменклатура = Неопределено Тогда
		ПоказатьПредупреждение(,"Не выбран товар",,"Предупреждение"); Возврат; КонецЕсли;
	
	ТекКартинка = ?(ЭтоНоваяКартинка, Неопределено, Элементы.СписокКартинок.ТекущаяСтрока);
	
	// Выберем картинку
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДВ.Выбрать() Тогда
		
		стрОшибки 	= "";
		ИмяФайла 	= Сред(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.Каталог) + 1);
		
		// Создадим новую картинку
	
		Если ТекКартинка = Неопределено Тогда ТекКартинка = ЗаписатьНовыйСправочник(Прав(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.ПолноеИмяФайла) - СтрДлина(ДВ.Каталог)), ТекНоменклатура);
			
			Если ТекКартинка = Неопределено Тогда
				Возврат КонецЕсли; КонецЕсли;
		
			//Элементы.СписокКартинок.ТекущаяСтрока = ТекКартинка;
			
		
		// Обновим
		
		Если Картинки.Обновить(Новый Картинка(ДВ.ПолноеИмяФайла), ТекКартинка, ЭтоАватар) Тогда
			
			Элементы.СписокНоменклатуры.Обновить();
			Элементы.СписокКартинок.Обновить();
			
			Элементы.СписокКартинок.ТекущаяСтрока = ТекКартинка;
			
			ОбновитьКартинки();
			
			//ПодключитьОбработчикОжидания("ОбновитьКартинки", 0.1, Истина);
		КонецЕсли; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаМаленькаяНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьКартинку(Истина, СтандартнаяОбработка)
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаБольшаяНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьКартинку(Ложь, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоГуиду(Команда)
	
	Перем СсылкаНоменклатура, СсылкаКартинка;
	
	стрГуид = "";
	Если 	ВвестиСтроку(стрГуид, "Гуид картинки:", 36) И
			стрГуид <> "" И
			НайтиПоГуидуНаСервере(стрГуид, СсылкаНоменклатура, СсылкаКартинка) Тогда
			
		Элементы.СписокНоменклатуры.ТекущаяСтрока = СсылкаНоменклатура;
		Элементы.СписокКартинок.ТекущаяСтрока = СсылкаКартинка;
		
		ОбновитьКартинки(); КонецЕсли;
		
КонецПроцедуры
&НаСервереБезКонтекста
Функция НайтиПоГуидуНаСервере(стрГуид, СсылкаНоменклатура, СсылкаКартинка)
	
	Попытка
		СсылкаКартинка = Справочники.КартинкиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(стрГуид));
	Исключение
		ОбщиеФункции.СообщитьТекст("Задан не верный формат гуида"); Возврат Ложь; КонецПопытки;
	
	Если СсылкаКартинка.Пустая() Тогда
		ОбщиеФункции.СообщитьТекст("Картинка по указаному гуиду не найдена"); Возврат Ложь; КонецЕсли;
	
	СсылкаНоменклатура = СсылкаКартинка.Владелец;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура НоваяКартинка(Команда)
	
	ЗагрузитьКартинку(Истина,, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Корзина

#Если Не ВебКлиент Тогда
	
&НаСервере
Функция ПоложитьВКорзинуНаСервере(СсылкиТовара, ИмяКомпа, КолВКорзине)
	
	Инексы 	= Новый Массив;
	Таблица = Новый ТаблицаЗначений;
	Инд		= -1;
	
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого Ссылка Из СсылкиТовара Цикл Инд = Инд + 1;Инексы.Добавить(Инд); НовСтрока = Таблица.Добавить(); НовСтрока.Номенклатура 	= Ссылка; НовСтрока.Количество 	= 1; КонецЦикла;
	
	Возврат МодульКорзины.ПоложитьТоварВКорзину(Таблица, Инексы, ИмяКомпа, КолВКорзине);
	
КонецФункции
&НаКлиенте
Процедура ПоложитьВКорзину(Команда)
	
	СсылкиТовара	 	= Элементы.СписокНоменклатуры.ВыделенныеСтроки;
	КолВКорзине 		= 0;
	КолТовара			= СсылкиТовара.Количество();
	
	Если КолТовара Тогда
		Если ПоложитьВКорзинуНаСервере(СсылкиТовара, ИмяКомпьютера(), КолВКорзине) Тогда
			МодульКорзины.ОповеститьОПомещенииТовара(КолТовара, КолВКорзине); КонецЕсли;
	Иначе
		МодульКорзины.ОповеститьЧтоНечегоДобавлять(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура РедактироватьТоварВКорзине(Команда)
	
	ОткрытьФорму("РегистрСведений.Корзина.Форма.Форма");
	
КонецПроцедуры
&НаСервере
Функция ОчиститьНаСервере(ИмяКомпа)
	
	Возврат МодульКорзины.ОчиститьКорзину(ИмяКомпа);
	
КонецФункции
&НаКлиенте
Процедура ОчиститьКорзину(Команда)
	
	Если ОчиститьНаСервере(ИмяКомпьютера()) Тогда МодульКорзины.ОповеститьЧтоКорзинаОчищена() КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

&НаСервере
Функция УстановитьКопииКартинокКорзины(ТекКартинка, ИмяКомпа, КолСтрок)
	
	Перем КартинкаОбъект;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	МодульКорзины.ПолучитьТоварИзКорзиныКакЕсть(Таблица, ИмяКомпа, КолСтрок);
	
	Для Каждого Строка Из Таблица Цикл
		
		// Найдем точно такуюже картинку
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.КартинкиНоменклатуры ГДЕ Владелец = &Владелец И КопияКартинки = &КопияКартинки");
		Запрос.УстановитьПараметр("Владелец", 		Строка.Номенклатура);
		Запрос.УстановитьПараметр("КопияКартинки", 	ТекКартинка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			КартинкаОбъект = Выборка.Ссылка.ПолучитьОбъект() 
		Иначе
			КартинкаОбъект = Справочники.КартинкиНоменклатуры.СоздатьЭлемент(); КонецЕсли;
		
		// Заполним реквизиты
		
		КартинкаОбъект.КопияКартинки = ТекКартинка;
		
		// Запишем
		
		Если ЗаписатьНовыйСправочник(ТекКартинка.Наименование, Строка.Номенклатура, КартинкаОбъект) = Неопределено Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
		
	Возврат Истина;	
	
КонецФункции
&НаКлиенте
Процедура Размножить(Команда)
	
	#Если ВебКлиент Тогда
		ПоказатьПредупреждение(,"Эта штука на веб клиенте не работает (",,"Предупреждение"); Возврат;		
	#Иначе
		
		ТекКартинка = Элементы.СписокКартинок.ТекущаяСтрока;
		Если ТекКартинка = Неопределено Тогда ПоказатьПредупреждение(,"Не выбрана картинка",,"Предупреждение"); Возврат; КонецЕсли;
		
		КолСтрок = 0;
		Если УстановитьКопииКартинокКорзины(ТекКартинка, ИмяКомпьютера(), КолСтрок) Тогда
			Если КолСтрок Тогда
				ПоказатьОповещениеПользователя("Картинки установлены",,"На все позиции в корзине (" + КолСтрок + ")", БиблиотекаКартинок.Скрепка);
				Элементы.СписокНоменклатуры.Обновить();
		Иначе
			ПоказатьПредупреждение(,"я бы и рад наплодить картинку, да только корзина пустая",,"Предупреждение"); КонецЕсли; КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры
